app/controllers/citylookup_controller.rb

SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 2  ORDER BY `cities`.`id` ASC LIMIT 1
---
  def index
  	@city = City.where(:id => params[:city_id].to_i).first

SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 2  ORDER BY `cities`.`id` ASC LIMIT 1
---
  def types_filter
  	@city = City.where(:id => params[:city_id].to_i).first